# CH2 變數與運算式

# 重點複習P2-5
#------------------------#
# 註解
name = "Frank" # 定義一個變數內容是"Frank"

# 三個單引號
'''
Frank老師是一個小帥哥
'''

# 三個雙引號
"""
Frank老師人非常好
"""
#----------------#


# 重點複習P2-6~P2-7
#------------------------#
# 資料型態
a = 10
b = 8.7
c = True # 數字時視為1
d = False # 數字時視為0

print(a+b)
print(a+c)
print(b-d)

# 跳脫字元 "\"
print("\'")
print("\"")
print("\t", 123, "\n")
#----------------#

# 重點複習P2-8
#------------------------#
# 資料型態轉換
num1 = 5 + 7.8
# 錯誤: num2 = 23 + "67"
num3 = 23 + int("67")
#----------------#

# 重點複習P2-9
#------------------------#
# 輸出與輸入
print("orange", "apple") # 預設是sep=" ", end="\n"
print("oragne", "apple", sep="+")
print("oragne", "apple", end="!")
#----------------#




